# 2. Закодируйте любую строку из трех слов по алгоритму Хаффмана.

a = 'veni, vidi, vici!'
print(' '.join(format(ord(x), 'b') for x in a))
print(' '.join(f'{ord(i):08b}' for i in a))

# Входная строка: 'veni, vidi, vici!'

# Входная строка в бинарном виде (ascii): 01110110 01100101 01101110 01101001 00101100 00100000 01110110
# 01101001 01100100 01101001 00101100 00100000 01110110 01101001 01100011 01101001 00100001


# Закодированная строка: 101 1101 1111 0100 0100 0100 1111 1001 0010 0010 0111 0101 1100